### Housing Market

In [1]:
#Import the necessary libraries
import pandas as pd
import numpy as np

In [2]:
#Create 3 differents Series, each of length 100, as follows:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

In [3]:
#Let's create a DataFrame by joinning the Series by column
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  2  2  23640
1  3  3  18256
2  3  3  20966
3  2  3  13544
4  4  2  28125

In [4]:
#Change the name of the columns to bedrs, bathrs, price_sqr_meter
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            23640
1      3       3            18256
2      3       3            20966
3      2       3            13544
4      4       2            28125

In [5]:
#Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       3
2       3
3       2
4       4
..    ...
95  28131
96  29538
97  14752
98  25070
99  29186

[300 rows x 1 columns]

In [6]:
#lenght of bigcolumn
len(bigcolumn)

300

In [7]:
#Reindex the DataFrame so it goes from 0 to 299
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        3
2        3
3        2
4        4
..     ...
295  28131
296  29538
297  14752
298  25070
299  29186

[300 rows x 1 columns]